## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 4 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| update   | `aws_iam_policy.api`                                      |
|          | `aws_iam_policy.ecr`                                      |
|          | `aws_lambda_alias.api_latest`                             |
|          | `aws_lambda_function.api`                                 |
| recreate | `aws_secretsmanager_secret_version.new-relic-license-key` |
|          | `null_resource.api_gateway_cloudwatch_logging[0]`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:34:54.166 STDOUT terraform:   ~ update in-place
14:34:54.166 STDOUT terraform: -/+ destroy and then create replacement
14:34:54.166 STDOUT terraform:  <= read (data resources)
14:34:54.166 STDOUT terraform: Terraform will perform the following actions:
14:34:54.166 STDOUT terraform:   # data.aws_iam_policy_document.api_policies will be read during apply
14:34:54.167 STDOUT terraform:   # (config refers to values not yet known)
14:34:54.167 STDOUT terraform:  <= data "aws_iam_policy_document" "api_policies" {
14:34:54.167 STDOUT terraform:       + id            = (known after apply)
14:34:54.167 STDOUT terraform:       + json          = (known after apply)
14:34:54.167 STDOUT terraform:       + minified_json = (known after apply)
14:34:54.167 STDOUT terraform:       + statement {
14:34:54.167 STDOUT terraform:           + actions   = [
14:34:54.167 STDOUT terraform:               + "logs:CreateLogStream",
14:34:54.167 STDOUT terraform:               + "logs:PutLogEvents",
14:34:54.167 STDOUT terraform:             ]
14:34:54.167 STDOUT terraform:           + effect    = "Allow"
14:34:54.167 STDOUT terraform:           + resources = [
14:34:54.167 STDOUT terraform:               + "arn:aws:logs:ca-central-1:239043911459:log-group:api_gateway_log_group",
14:34:54.167 STDOUT terraform:             ]
14:34:54.167 STDOUT terraform:         }
14:34:54.167 STDOUT terraform:       + statement {
14:34:54.167 STDOUT terraform:           + actions   = [
14:34:54.167 STDOUT terraform:               + "ecr:BatchGetImage",
14:34:54.167 STDOUT terraform:               + "ecr:GetDownloadUrlForlayer",
14:34:54.167 STDOUT terraform:             ]
14:34:54.167 STDOUT terraform:           + effect    = "Allow"
14:34:54.167 STDOUT terraform:           + resources = [
14:34:54.167 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
14:34:54.167 STDOUT terraform:             ]
14:34:54.167 STDOUT terraform:         }
14:34:54.167 STDOUT terraform:       + statement {
14:34:54.167 STDOUT terraform:           + actions   = [
14:34:54.167 STDOUT terraform:               + "s3:*",
14:34:54.167 STDOUT terraform:             ]
14:34:54.167 STDOUT terraform:           + effect    = "Allow"
14:34:54.167 STDOUT terraform:           + resources = [
14:34:54.167 STDOUT terraform:               + "arn:aws:s3:::notification-canada-ca-staging-csv-upload/*",
14:34:54.168 STDOUT terraform:               + "arn:aws:s3:::notification-canada-ca-staging-gc-organisations/*",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:         }
14:34:54.168 STDOUT terraform:       + statement {
14:34:54.168 STDOUT terraform:           + actions   = [
14:34:54.168 STDOUT terraform:               + "securityhub:BatchImportFindings",
14:34:54.168 STDOUT terraform:               + "sns:Publish",
14:34:54.168 STDOUT terraform:               + "sqs:*",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:           + effect    = "Allow"
14:34:54.168 STDOUT terraform:           + resources = [
14:34:54.168 STDOUT terraform:               + "*",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:         }
14:34:54.168 STDOUT terraform:       + statement {
14:34:54.168 STDOUT terraform:           + actions   = [
14:34:54.168 STDOUT terraform:               + "ssm:DescribeParameters",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:           + effect    = "Allow"
14:34:54.168 STDOUT terraform:           + resources = [
14:34:54.168 STDOUT terraform:               + "*",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:         }
14:34:54.168 STDOUT terraform:       + statement {
14:34:54.168 STDOUT terraform:           + actions   = [
14:34:54.168 STDOUT terraform:               + "ssm:GetParameters",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:           + effect    = "Allow"
14:34:54.168 STDOUT terraform:           + resources = (sensitive value)
14:34:54.168 STDOUT terraform:         }
14:34:54.168 STDOUT terraform:       + statement {
14:34:54.168 STDOUT terraform:           + actions   = [
14:34:54.168 STDOUT terraform:               + "secretsmanager:GetSecretValue",
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:           + effect    = "Allow"
14:34:54.168 STDOUT terraform:           + resources = [
14:34:54.168 STDOUT terraform:               + (known after apply),
14:34:54.168 STDOUT terraform:             ]
14:34:54.168 STDOUT terraform:         }
14:34:54.168 STDOUT terraform:       + statement {
14:34:54.168 STDOUT terraform:           + actions   = [
14:34:54.168 STDOUT terraform:               + "cloudwatch:GetMetricData",
14:34:54.168 STDOUT terraform:               + "cloudwatch:GetMetricStatistics",
14:34:54.168 STDOUT terraform:               + "cloudwatch:ListMetrics",
14:34:54.168 STDOUT terraform:               + "config:BatchGetResourceConfig",
14:34:54.169 STDOUT terraform:               + "config:ListDiscoveredResources",
14:34:54.169 STDOUT terraform:               + "lambda:GetAccountSettings",
14:34:54.169 STDOUT terraform:               + "lambda:ListAliases",
14:34:54.169 STDOUT terraform:               + "lambda:ListEventSourceMappings",
14:34:54.169 STDOUT terraform:               + "lambda:ListFunctions",
14:34:54.169 STDOUT terraform:               + "lambda:ListTags",
14:34:54.169 STDOUT terraform:               + "tag:GetResources",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + effect    = "Allow"
14:34:54.169 STDOUT terraform:           + resources = [
14:34:54.169 STDOUT terraform:               + "*",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:         }
14:34:54.169 STDOUT terraform:       + statement {
14:34:54.169 STDOUT terraform:           + actions   = [
14:34:54.169 STDOUT terraform:               + "xray:PutTelemetryRecords",
14:34:54.169 STDOUT terraform:               + "xray:PutTraceSegments",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + effect    = "Allow"
14:34:54.169 STDOUT terraform:           + resources = [
14:34:54.169 STDOUT terraform:               + "*",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:         }
14:34:54.169 STDOUT terraform:     }
14:34:54.169 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
14:34:54.169 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:34:54.169 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
14:34:54.169 STDOUT terraform:       + id            = (known after apply)
14:34:54.169 STDOUT terraform:       + json          = (known after apply)
14:34:54.169 STDOUT terraform:       + minified_json = (known after apply)
14:34:54.169 STDOUT terraform:       + statement {
14:34:54.169 STDOUT terraform:           + actions   = [
14:34:54.169 STDOUT terraform:               + "ecr:GetAuthorizationToken",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + effect    = "Allow"
14:34:54.169 STDOUT terraform:           + resources = [
14:34:54.169 STDOUT terraform:               + "*",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + sid       = "GetAuthorizationToken"
14:34:54.169 STDOUT terraform:         }
14:34:54.169 STDOUT terraform:       + statement {
14:34:54.169 STDOUT terraform:           + actions   = [
14:34:54.169 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
14:34:54.169 STDOUT terraform:               + "ecr:BatchGetImage",
14:34:54.169 STDOUT terraform:               + "ecr:CompleteLayerUpload",
14:34:54.169 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
14:34:54.169 STDOUT terraform:               + "ecr:InitiateLayerUpload",
14:34:54.169 STDOUT terraform:               + "ecr:PutImage",
14:34:54.169 STDOUT terraform:               + "ecr:UploadLayerPart",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + effect    = "Allow"
14:34:54.169 STDOUT terraform:           + resources = [
14:34:54.169 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
14:34:54.169 STDOUT terraform:             ]
14:34:54.169 STDOUT terraform:           + sid       = "AllowPushPull"
14:34:54.169 STDOUT terraform:         }
14:34:54.169 STDOUT terraform:       + statement {
14:34:54.169 STDOUT terraform:           + actions   = [
14:34:54.169 STDOUT terraform:               + "lambda:GetAlias",
14:34:54.169 STDOUT terraform:               + "lambda:GetFunction",
14:34:54.169 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
14:34:54.169 STDOUT terraform:               + "lambda:ListAliases",
14:34:54.170 STDOUT terraform:               + "lambda:ListVersionsByFunction",
14:34:54.170 STDOUT terraform:               + "lambda:PublishVersion",
14:34:54.170 STDOUT terraform:               + "lambda:UpdateAlias",
14:34:54.170 STDOUT terraform:               + "lambda:UpdateFunctionCode",
14:34:54.170 STDOUT terraform:             ]
14:34:54.170 STDOUT terraform:           + effect    = "Allow"
14:34:54.170 STDOUT terraform:           + resources = [
14:34:54.170 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
14:34:54.170 STDOUT terraform:             ]
14:34:54.170 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
14:34:54.170 STDOUT terraform:         }
14:34:54.170 STDOUT terraform:       + statement {
14:34:54.170 STDOUT terraform:           + actions   = [
14:34:54.170 STDOUT terraform:               + "lambda:GetLayerVersion",
14:34:54.170 STDOUT terraform:             ]
14:34:54.170 STDOUT terraform:           + effect    = "Allow"
14:34:54.170 STDOUT terraform:           + resources = [
14:34:54.170 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
14:34:54.170 STDOUT terraform:             ]
14:34:54.170 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
14:34:54.170 STDOUT terraform:         }
14:34:54.170 STDOUT terraform:     }
14:34:54.170 STDOUT terraform:   # aws_iam_policy.api will be updated in-place
14:34:54.170 STDOUT terraform:   ~ resource "aws_iam_policy" "api" {
14:34:54.170 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/notify-api"
14:34:54.170 STDOUT terraform:         name             = "notify-api"
14:34:54.170 STDOUT terraform:       ~ policy           = jsonencode(
14:34:54.170 STDOUT terraform:             {
14:34:54.170 STDOUT terraform:               - Statement = [
14:34:54.170 STDOUT terraform:                   - {
14:34:54.170 STDOUT terraform:                       - Action   = [
14:34:54.170 STDOUT terraform:                           - "logs:PutLogEvents",
14:34:54.170 STDOUT terraform:                           - "logs:CreateLogStream",
14:34:54.170 STDOUT terraform:                         ]
14:34:54.170 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.170 STDOUT terraform:                       - Resource = "arn:aws:logs:ca-central-1:239043911459:log-group:api_gateway_log_group"
14:34:54.170 STDOUT terraform:                     },
14:34:54.170 STDOUT terraform:                   - {
14:34:54.170 STDOUT terraform:                       - Action   = [
14:34:54.170 STDOUT terraform:                           - "ecr:GetDownloadUrlForlayer",
14:34:54.170 STDOUT terraform:                           - "ecr:BatchGetImage",
14:34:54.170 STDOUT terraform:                         ]
14:34:54.170 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.170 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
14:34:54.170 STDOUT terraform:                     },
14:34:54.170 STDOUT terraform:                   - {
14:34:54.170 STDOUT terraform:                       - Action   = "s3:*"
14:34:54.170 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.170 STDOUT terraform:                       - Resource = [
14:34:54.170 STDOUT terraform:                           - "arn:aws:s3:::notification-canada-ca-staging-gc-organisations/*",
14:34:54.170 STDOUT terraform:                           - "arn:aws:s3:::notification-canada-ca-staging-csv-upload/*",
14:34:54.171 STDOUT terraform:                         ]
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = [
14:34:54.171 STDOUT terraform:                           - "sqs:*",
14:34:54.171 STDOUT terraform:                           - "sns:Publish",
14:34:54.171 STDOUT terraform:                           - "securityhub:BatchImportFindings",
14:34:54.171 STDOUT terraform:                         ]
14:34:54.171 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.171 STDOUT terraform:                       - Resource = "*"
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = "ssm:DescribeParameters"
14:34:54.171 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.171 STDOUT terraform:                       - Resource = "*"
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = "ssm:GetParameters"
14:34:54.171 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.171 STDOUT terraform:                       - Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter/ENVIRONMENT_VARIABLES"
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = "secretsmanager:GetSecretValue"
14:34:54.171 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.171 STDOUT terraform:                       - Resource = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v"
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = [
14:34:54.171 STDOUT terraform:                           - "tag:GetResources",
14:34:54.171 STDOUT terraform:                           - "lambda:ListTags",
14:34:54.171 STDOUT terraform:                           - "lambda:ListFunctions",
14:34:54.171 STDOUT terraform:                           - "lambda:ListEventSourceMappings",
14:34:54.171 STDOUT terraform:                           - "lambda:ListAliases",
14:34:54.171 STDOUT terraform:                           - "lambda:GetAccountSettings",
14:34:54.171 STDOUT terraform:                           - "config:ListDiscoveredResources",
14:34:54.171 STDOUT terraform:                           - "config:BatchGetResourceConfig",
14:34:54.171 STDOUT terraform:                           - "cloudwatch:ListMetrics",
14:34:54.171 STDOUT terraform:                           - "cloudwatch:GetMetricStatistics",
14:34:54.171 STDOUT terraform:                           - "cloudwatch:GetMetricData",
14:34:54.171 STDOUT terraform:                         ]
14:34:54.171 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.171 STDOUT terraform:                       - Resource = "*"
14:34:54.171 STDOUT terraform:                     },
14:34:54.171 STDOUT terraform:                   - {
14:34:54.171 STDOUT terraform:                       - Action   = [
14:34:54.171 STDOUT terraform:                           - "xray:PutTraceSegments",
14:34:54.171 STDOUT terraform:                           - "xray:PutTelemetryRecords",
14:34:54.171 STDOUT terraform:                         ]
14:34:54.172 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.172 STDOUT terraform:                       - Resource = "*"
14:34:54.172 STDOUT terraform:                     },
14:34:54.172 STDOUT terraform:                 ]
14:34:54.172 STDOUT terraform:               - Version   = "2012-10-17"
14:34:54.172 STDOUT terraform:             }
14:34:54.172 STDOUT terraform:         ) -> (known after apply)
14:34:54.172 STDOUT terraform:         tags             = {}
14:34:54.172 STDOUT terraform:         # (7 unchanged attributes hidden)
14:34:54.172 STDOUT terraform:     }
14:34:54.172 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
14:34:54.172 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
14:34:54.172 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
14:34:54.172 STDOUT terraform:         name             = "ecr-api-lambda-access"
14:34:54.172 STDOUT terraform:       ~ policy           = jsonencode(
14:34:54.172 STDOUT terraform:             {
14:34:54.172 STDOUT terraform:               - Statement = [
14:34:54.172 STDOUT terraform:                   - {
14:34:54.172 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
14:34:54.172 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.172 STDOUT terraform:                       - Resource = "*"
14:34:54.172 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
14:34:54.172 STDOUT terraform:                     },
14:34:54.172 STDOUT terraform:                   - {
14:34:54.172 STDOUT terraform:                       - Action   = [
14:34:54.172 STDOUT terraform:                           - "ecr:UploadLayerPart",
14:34:54.172 STDOUT terraform:                           - "ecr:PutImage",
14:34:54.172 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
14:34:54.172 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
14:34:54.172 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
14:34:54.172 STDOUT terraform:                           - "ecr:BatchGetImage",
14:34:54.172 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
14:34:54.172 STDOUT terraform:                         ]
14:34:54.172 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.172 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
14:34:54.172 STDOUT terraform:                       - Sid      = "AllowPushPull"
14:34:54.172 STDOUT terraform:                     },
14:34:54.172 STDOUT terraform:                   - {
14:34:54.172 STDOUT terraform:                       - Action   = [
14:34:54.172 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
14:34:54.172 STDOUT terraform:                           - "lambda:UpdateAlias",
14:34:54.172 STDOUT terraform:                           - "lambda:PublishVersion",
14:34:54.172 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
14:34:54.172 STDOUT terraform:                           - "lambda:ListAliases",
14:34:54.172 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
14:34:54.172 STDOUT terraform:                           - "lambda:GetFunction",
14:34:54.172 STDOUT terraform:                           - "lambda:GetAlias",
14:34:54.172 STDOUT terraform:                         ]
14:34:54.172 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.172 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
14:34:54.173 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
14:34:54.173 STDOUT terraform:                     },
14:34:54.173 STDOUT terraform:                   - {
14:34:54.173 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
14:34:54.173 STDOUT terraform:                       - Effect   = "Allow"
14:34:54.173 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
14:34:54.173 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
14:34:54.173 STDOUT terraform:                     },
14:34:54.173 STDOUT terraform:                 ]
14:34:54.173 STDOUT terraform:               - Version   = "2012-10-17"
14:34:54.173 STDOUT terraform:             }
14:34:54.173 STDOUT terraform:         ) -> (known after apply)
14:34:54.173 STDOUT terraform:         tags             = {}
14:34:54.173 STDOUT terraform:         # (7 unchanged attributes hidden)
14:34:54.173 STDOUT terraform:     }
14:34:54.173 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
14:34:54.173 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
14:34:54.173 STDOUT terraform:       ~ function_version = "1722" -> (known after apply)
14:34:54.173 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
14:34:54.173 STDOUT terraform:         name             = "latest"
14:34:54.173 STDOUT terraform:         # (5 unchanged attributes hidden)
14:34:54.173 STDOUT terraform:     }
14:34:54.173 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
14:34:54.173 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
14:34:54.173 STDOUT terraform:         id                             = "api-lambda"
14:34:54.173 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1722" -> (known after apply)
14:34:54.173 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1722/invocations" -> (known after apply)
14:34:54.173 STDOUT terraform:         tags                           = {}
14:34:54.173 STDOUT terraform:       ~ version                        = "1722" -> (known after apply)
14:34:54.173 STDOUT terraform:         # (27 unchanged attributes hidden)
14:34:54.173 STDOUT terraform:       ~ environment {
14:34:54.173 STDOUT terraform:           ~ variables = {
14:34:54.173 STDOUT terraform:               ~ "NEW_RELIC_APP_NAME"                    = "notification-api-staging" -> "notification-lambda-api-staging"
14:34:54.173 STDOUT terraform:               - "NEW_RELIC_IGNORE_STARTUP_ERRORS"       = "false" -> null
14:34:54.173 STDOUT terraform:               - "NEW_RELIC_LOG"                         = "stdout" -> null
14:34:54.173 STDOUT terraform:               - "NEW_RELIC_LOG_LEVEL"                   = "debug" -> null
14:34:54.173 STDOUT terraform:               - "NR_STARTUP_DIAG"                       = "1" -> null
14:34:54.173 STDOUT terraform:                 # (18 unchanged elements hidden)
14:34:54.174 STDOUT terraform:             }
14:34:54.174 STDOUT terraform:         }
14:34:54.174 STDOUT terraform:         # (4 unchanged blocks hidden)
14:34:54.174 STDOUT terraform:     }
14:34:54.174 STDOUT terraform:   # aws_secretsmanager_secret_version.new-relic-license-key must be replaced
14:34:54.174 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "new-relic-license-key" {
14:34:54.174 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v" -> (known after apply)
14:34:54.174 STDOUT terraform:       + has_secret_string_wo = (known after apply)
14:34:54.174 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:NEW_RELIC_LICENSE_KEY-bDjJ9v|terraform-20250813163058425700000001" -> (known after apply)
14:34:54.174 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
14:34:54.174 STDOUT terraform:       ~ version_id           = "terraform-20250813163058425700000001" -> (known after apply)
14:34:54.174 STDOUT terraform:       ~ version_stages       = [
14:34:54.174 STDOUT terraform:           - "AWSCURRENT",
14:34:54.174 STDOUT terraform:         ] -> (known after apply)
14:34:54.174 STDOUT terraform:         # (4 unchanged attributes hidden)
14:34:54.174 STDOUT terraform:     }
14:34:54.174 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
14:34:54.174 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
14:34:54.174 STDOUT terraform:       ~ id       = "206422844654225035" -> (known after apply)
14:34:54.174 STDOUT terraform:       ~ triggers = { # forces replacement
14:34:54.174 STDOUT terraform:           ~ "always_run" = "2025-09-18T19:55:38Z" -> (known after apply)
14:34:54.174 STDOUT terraform:         }
14:34:54.174 STDOUT terraform:     }
14:34:54.174 STDOUT terraform: Plan: 2 to add, 4 to change, 2 to destroy.
14:34:54.174 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
14:34:54.174 STDOUT terraform: Saved the plan to: plan.tfplan
14:34:54.174 STDOUT terraform: To perform exactly these actions, run the following command to apply:
14:34:54.174 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
